// 1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).



for(let i = 20; i <= 30; i += 0.5) {
    //console.log(i)
}

// 2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let dollar = 27

for(let i = 10; i <= 100 ; i += 10) {
    //console.log(i*dollar)
}

// 3 Дане ціле число. Вивести всі цілі числа від 10 до 100, квадрат яких не перевищує числа N.

let n = 5600

for (let i = 10; i <= 100; i++ ) {
     if(i*i <= 5600) {
        //console.log(i)
     }
}


// 4 Данe ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let num = 13 ;
let result = true;

for(let i = 2; i < num; i++ ) {
    if(num % i === 0) {
        
        result = false;
        break;
    }
}
//console.log(result)

// 5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
let numPow = 81
let resultPow = false

for(let i = 1; i <= numPow; i++ ) {
    if(Math.pow(3 , i) === numPow) {
     
        
     resultPow = true
     break;
    }
}
//console.log(resultPow)


